; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-1-11-9)
(:domain gripper-strips)
(:objects robot1 - robot
rgripper1 lgripper1 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 - object)
(:init
(at-robby robot1 room9)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at ball1 room1)
(at ball2 room7)
(at ball3 room9)
(at ball4 room2)
(at ball5 room7)
(at ball6 room6)
(at ball7 room6)
(at ball8 room3)
(at ball9 room7)
)
(:goal
(and
(at ball1 room8)
(at ball2 room9)
(at ball3 room3)
(at ball4 room1)
(at ball5 room7)
(at ball6 room9)
(at ball7 room4)
(at ball8 room4)
(at ball9 room8)
)
)
)

; plan
1. (pick robot1 ball3 room9 lgripper1)
   deleted: (at ball3 room9) (free robot1 lgripper1)
   added: (carry robot1 ball3 lgripper1)
   goals met: 1 of 9
2. (move robot1 room9 room3)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room3)
   goals met: 1 of 9
3. (drop robot1 ball3 room3 lgripper1)
   deleted: (carry robot1 ball3 lgripper1)
   added: (at ball3 room3) (free robot1 lgripper1)
   goals met: 2 of 9
4. (pick robot1 ball8 room3 rgripper1)
   deleted: (at ball8 room3) (free robot1 rgripper1)
   added: (carry robot1 ball8 rgripper1)
   goals met: 2 of 9
5. (move robot1 room3 room8)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room8)
   goals met: 2 of 9
6. (move robot1 room8 room4)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room4)
   goals met: 2 of 9
7. (drop robot1 ball8 room4 rgripper1)
   deleted: (carry robot1 ball8 rgripper1)
   added: (at ball8 room4) (free robot1 rgripper1)
   goals met: 3 of 9
8. (move robot1 room4 room7)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room7)
   goals met: 3 of 9
9. (pick robot1 ball9 room7 lgripper1)
   deleted: (at ball9 room7) (free robot1 lgripper1)
   added: (carry robot1 ball9 lgripper1)
   goals met: 3 of 9
10. (pick robot1 ball2 room7 rgripper1)
   deleted: (at ball2 room7) (free robot1 rgripper1)
   added: (carry robot1 ball2 rgripper1)
   goals met: 3 of 9
11. (move robot1 room7 room8)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room8)
   goals met: 3 of 9
12. (drop robot1 ball9 room8 lgripper1)
   deleted: (carry robot1 ball9 lgripper1)
   added: (at ball9 room8) (free robot1 lgripper1)
   goals met: 4 of 9
13. (move robot1 room8 room9)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room9)
   goals met: 4 of 9
14. (drop robot1 ball2 room9 rgripper1)
   deleted: (carry robot1 ball2 rgripper1)
   added: (at ball2 room9) (free robot1 rgripper1)
   goals met: 5 of 9
15. (move robot1 room9 room6)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room6)
   goals met: 5 of 9
16. (pick robot1 ball7 room6 lgripper1)
   deleted: (at ball7 room6) (free robot1 lgripper1)
   added: (carry robot1 ball7 lgripper1)
   goals met: 5 of 9
17. (pick robot1 ball6 room6 rgripper1)
   deleted: (at ball6 room6) (free robot1 rgripper1)
   added: (carry robot1 ball6 rgripper1)
   goals met: 5 of 9
18. (move robot1 room6 room8)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room8)
   goals met: 5 of 9
19. (move robot1 room8 room4)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room4)
   goals met: 5 of 9
20. (drop robot1 ball7 room4 lgripper1)
   deleted: (carry robot1 ball7 lgripper1)
   added: (at ball7 room4) (free robot1 lgripper1)
   goals met: 6 of 9
21. (move robot1 room4 room8)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room8)
   goals met: 6 of 9
22. (move robot1 room8 room9)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room9)
   goals met: 6 of 9
23. (drop robot1 ball6 room9 rgripper1)
   deleted: (carry robot1 ball6 rgripper1)
   added: (at ball6 room9) (free robot1 rgripper1)
   goals met: 7 of 9
24. (move robot1 room9 room8)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room8)
   goals met: 7 of 9
25. (move robot1 room8 room2)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room2)
   goals met: 7 of 9
26. (pick robot1 ball4 room2 lgripper1)
   deleted: (at ball4 room2) (free robot1 lgripper1)
   added: (carry robot1 ball4 lgripper1)
   goals met: 7 of 9
27. (move robot1 room2 room8)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room8)
   goals met: 7 of 9
28. (move robot1 room8 room1)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room1)
   goals met: 7 of 9
29. (drop robot1 ball4 room1 lgripper1)
   deleted: (carry robot1 ball4 lgripper1)
   added: (at ball4 room1) (free robot1 lgripper1)
   goals met: 8 of 9
30. (pick robot1 ball1 room1 rgripper1)
   deleted: (at ball1 room1) (free robot1 rgripper1)
   added: (carry robot1 ball1 rgripper1)
   goals met: 8 of 9
31. (move robot1 room1 room8)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room8)
   goals met: 8 of 9
32. (drop robot1 ball1 room8 rgripper1)
   deleted: (carry robot1 ball1 rgripper1)
   added: (at ball1 room8) (free robot1 rgripper1)
   goals met: 9 of 9
